# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Arranjos 1D
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS:   H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}

* Configuração                                                     :noexport:

#+BEGIN_SRC emacs-lisp
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
(setq org-latex-minted-options
       '(("frame" "lines")
         ("fontsize" "\\scriptsize")))
#+END_SRC

#+RESULTS:
| frame    | lines       |
| fontsize | \scriptsize |
* Onde ficam guardados esses dados de inicialização?

#+BEGIN_CENTER
Observe a diferença de tamanho do

código compilado entre as duas versões.
#+END_CENTER

\to Arquivo =a15-init-arranjo-1.c=
#+BEGIN_SRC C :tangle e/a15-init-arranjo-1.c
int vetor[10] = {4, 7, 20, 31, 57, 21, 87, 12, 99, 34};
#+END_SRC

#+BEGIN_SRC bash :dir e
gcc -c a15-init-arranjo-1.c
wc -c a15-init-arranjo-1.o
#+END_SRC

#+RESULTS:
: 1008 a15-init-arranjo-1.o

\to Arquivo =a15-init-arranjo-2.c=
#+BEGIN_SRC C :tangle e/a15-init-arranjo-2.c
int vetor[10];
#+END_SRC

#+BEGIN_SRC bash :dir e
gcc -c a15-init-arranjo-2.c
wc -c a15-init-arranjo-2.o
#+END_SRC

#+RESULTS:
: 968 a15-init-arranjo-2.o

* Código =a15-aleatorio.c= com chamada para =rand()=

#+BEGIN_SRC C :tangle e/a15-aleatorio.c
/* Programa para exemplificar o uso do rand()
Entradas: não há
Saidas: Impressao de 3 numeros aleatorios */
#include <stdio.h>
#include <stdlib.h>
int main() {
  int cont;
  for (cont = 0; cont < 3; cont++)
    printf("%d ",rand());
  printf("\n");
  return 0;
}
#+END_SRC

Vamos executar este código duas vezes:

#+begin_src shell :results output :dir e
gcc a15-aleatorio.c -o a15-aleatorio
./a15-aleatorio; ./a15-aleatorio
#+end_src

#+RESULTS:
: 1804289383 846930886 1681692777 
: 1804289383 846930886 1681692777 

As sequências aleatórias são as mesmas.
* Código =a15-aleatorio.c= com =rand()= e =srand()=

#+BEGIN_SRC C :tangle e/a15-aleatorio-2.c
/* Programa para exemplificar o uso do rand()
Entradas: não há
Saidas: Impressao de 3 numeros aleatorios */
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
int main() {
  int cont;
  srand(time(NULL));
  for (cont = 0; cont < 3; cont++)
    printf("%d ",rand());
  printf("\n");
  return 0;
}
#+END_SRC

Vamos executar este código duas vezes:

#+begin_src shell :results output :dir e
gcc a15-aleatorio-2.c -o a15-aleatorio
./a15-aleatorio; sleep 1; ./a15-aleatorio
#+end_src

#+RESULTS:
: 1676783244 1916870555 691099145 
: 1379384142 1735614581 271097401 

As sequências aleatórias não são mais as mesmas.
